account.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soap:Header>
      <AgentSession xmlns="https://entservices.totalegame.net">
         <SessionGUID>556ed097-0806-4a66-80c3-557478a5bcf5</SessionGUID>
         <ErrorCode>0</ErrorCode>
         <IPAddress>119.9.104.93</IPAddress>
         <IsExtendSession>true</IsExtendSession>
      </AgentSession>
   </soap:Header>
   <soap:Body>
      <AddAccount xmlns="https://entservices.totalegame.net">
         <password>1234</password>
         <firstName>Abry</firstName>
         <lastName>DV</lastName>
         <email>abry@test.com</email>
         <BettingProfileId>1</BettingProfileId>
         <currency>1</currency>
      </AddAccount>
   </soap:Body>
</soap:Envelope>


<!-- soapAction:'https://graphical.weather.gov/xml/DWMLgen/wsdl/ndfdXML.wsdl#LatLonListZipCode' -->

<!-- curl -H "Content-Type: text/xml; charset=utf-8" -H 'SOAPAction: "https://entservices.totalegame.net/AddAccount"'  --data-binary @account.xml https://entv3-200.totalegame.net/ -->

<!-- <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><IsAuthenticateResponse xmlns="https://entservices.totalegame.net"><IsAuthenticateResult><SessionGUID>556ed097-0806-4a66-80c3-557478a5bcf5</SessionGUID><ErrorCode>0</ErrorCode><IPAddress>119.9.104.93</IPAddress><IsExtendSession>true</IsExtendSession><IsSucceed>true</IsSucceed></IsAuthenticateResult></IsAuthenticateResponse></soap:Body></soap:Envelope>[root@task test]#
 -->